document.addEventListener("DOMContentLoaded", () => {
	const kiteRunner = document.getElementById("kiteRunner");
	const walking = document.getElementById("walking");
	const love = document.getElementById("love");
	const thinkBig = document.getElementById("thinkBig");
	const choosen = document.getElementById("choosen");
	const bookSummary = document.getElementById("bookSummary");
	const main = document.getElementById('main')
	const summaries = [
		`بادبادک‌باز یا کاغذپران باز (به انگلیسی: The Kite Runner) نخستین اثر منتشر شدهٔ خالد حسینی، نویسنده افغانستانی است. این کتاب رمانی به زبان انگلیسی است و نخستین اثر یک نویسندهٔ افغانستانی به زبان انگلیسی محسوب می‌شود. در سال ۲۰۰۷ میلادی فیلمی بر اساس این کتاب ساخته شد.

داستان از زبان امیر روایت می‌شود، امیر یک نویسندهٔ اهل افغانستان از تبار پشتون ساکن کالیفرنیا است که برای نجات بچه دوستش یعنی حسن راهی افغانستان می‌شود؛ افغانستانی که در تحت حاکمیت طالبان است و یکی از سخت‌ترین دوران تاریخ چند هزار ساله‌اش را سپری می‌کند و به بهانهٔ این سفر، امیر داستان زندگی‌اش را تعریف می‌کند...`,
		`قدم زدن روی ماه با اینشتین یک کتاب معمولی نیست یک سفر هیجان‌ انگیز است. سفری حیرت‌ آور و جذاب با عینک یک روزنامه ‌نگار که شما را به دنیای ذهن می‌برد.
نویسنده کتاب خود را با خاطره‌ای شروع می‌کند؛ او برای تهیه‌ی یک گزارش به مسابقه‌ی حافظه می‌رود و با شرکت‌کنندگان این مسابقه صحبت می‌کند و همه اقرار می‌نمایند که حافظه‌ای متوسط دارند و صرفاً با تمرین و تلاش توانسته‌اند به این موقعیت و توانایی دست پیدا کنند. در آخر هم در مسابقات حافظه آمریکا شرکت میکند و قهرمان میشود، کسی که سال قبلش خبرنگار این مسابقات بود سال بعدش قهرمان می شود!

این خبرنگار در هر بخش با ذکر مثال، نکات علمی و صحبت‌های نظریه‌پردازان، سعی می‌کند تا مفیدترین و بهترین روش جهت تقویت حافظه را به برای شما شرح دهد. کتاب قدم زدن روی ماه با اینشتین به شما نشان می‌دهد که تمام انسان‌ها قادر خواهند بود تا یک حافظه‌ی قوی داشته باشند و تنها باید از روش‌های درست استفاده کنند.`,
		`این کتاب شامل یک مقدمه و پنج بخش است (بخش اول: خاک، بخش دوم آب، بخش سوم: باد، بخش چهارم: آتش، بخش پنجم: خلاء) که دو داستان را شامل می‌شوند که به زیبایی در کنار هم و در یک کتاب گنجانده شده‌اند؛ که بیش از ۱۵ راوی دارد، دو رمان در این کتاب که موازی هم جلو می‌روند؛ و به گونه‌ای به همدیگر ارتباط دارند. یکی از این داستان‌ها در قرن بیست و یکم میلادی (از ماه مه ۲۰۰۸ تا سپتامبر ۲۰۰۹) در آمریکا و دیگری در قرن سیزدهم میلادی / هفتم هجری (از رمضان ۶۳۹ تا ذیقعده ۶۵۸) در قونیه اتفاق می‌افتد. ملت عشق داستان زندگی زنی در غرب را روایت می‌کند که با عرفان شرق آشنا می‌شود.

داستان اول کتاب مربوط به الا روبینشتاین است که در بوستونِ آمریکا زندگی می‌کند. الا یک همسر و مادر است که همه زندگی خود را صرف خانواده کرده‌است. با این که همسر الا ـ دیوید ـ دندانپزشک مشهوری بود و معیشت آن‌ها در سطح ایدئالی قرار داشت اما عشق و صمیمیتی در میان آن‌ها نبود. الا این موضوع را پذیرفته بود و همه اولویت‌های خود را تغییر داده بود و فقط به فکر بچه‌هایش بود. اما با این حال، رابطه الا با خانواده‌اش هم چندان خوب نبود. طبق تشبیه کتاب، الا شبیه برکه بود، برکه‌ای راکد که بعد از گذشت بیست سال زندگی مشترک با همسرش، خود را بازنده این زندگی می‌بیند. سرانجام در اولین روزهای چهل سالگی تصمیم می‌گیرد از قید و بند این زندگی آزاد شود و زندگی خود را تغییر دهد.

داستان دوم داستان زندگی شمس تبریزی و سفرهای او از سمرقند تا بغداد و سپس به قونیه و آشنایی و برخورد او با مولانا در شهر قونیه است. این داستان در قالب کتابی روایت می‌شود که الا روبینشتاین به عنوان ویراستار مسئول ویرایش آن می‌شود و از خلال خواندن این کتاب با زندگی شمس و مولانا و چهل قاعدهٔ عشق از دیدگاه و زبان شمس تبریزی آشنا می‌شود.`,
		`کتاب “بزرگ فکر کن: موفقیت در کار و زندگی به روش دانالد ترامپ” نوشته بیل زنکر و دونالد ترامپ است1. این کتاب به زبان فارسی ترجمه شده و توسط انتشارات گندمان منتشر شده است1.

این کتاب در سال 1395 به چاپ رسیده و تعداد صفحات آن 168 صفحه است1. این کتاب در قالب رقعی (شومیز) چاپ شده و تیراژ آن 750 نسخه است1.

کتاب “بزرگ فکر کن” به بررسی روش‌های موفقیت در کار و زندگی به سبک دانالد ترامپ می‌پردازد1. این کتاب می‌تواند راهنمایی برای کسانی باشد که به دنبال راه‌هایی برای بهبود عملکرد خود در کار و زندگی هستند.`,
	];

	function choose(img) {
		choosen.src = img.target.src;
		switch (img.target.id) {
			case 'kiteRunner': bookSummary.textContent=summaries[0]
				break;
			
			case 'walking': bookSummary.textContent = summaries[1]
				break;
			
			case 'love': bookSummary.textContent = summaries[2]
				break;
			
			case 'thinkBig' : bookSummary.textContent = summaries[3]
		}

	}

	kiteRunner.addEventListener("click", choose);
	walking.addEventListener("click", choose);
	love.addEventListener("click", choose);
	thinkBig.addEventListener("click", choose);

	const colors = [
		"bg-violet-500",
		"#475569",
		"#f97316",
		"#fbbf24",
		"#84cc16",
		"#16a34a",
		"#0ea5e9",
		"#2563eb",
		"#6d28d9",
		"#e879f9",
		];
	main.addEventListener('click', () => {
		for (i = 0; i < colors.length; i++){
			body.style.backgroundColor = colors[i]
		}
	})
});
